benchmarks/raw/s3_baseline/heavy_c1_t2.txt
Running 30s test @ http://localhost:8080
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   665.92us  836.51us  13.60ms   89.22%
    Req/Sec     1.61k   478.97     2.71k    64.67%
  Latency Distribution
     50%  338.00us
     75%  763.00us
     90%    1.55ms
     99%    4.20ms
  48148 requests in 30.03s, 4.83GB read
Requests/sec:   1603.19
Transfer/sec:    164.69MB