benchmarks/raw/s3_baseline/large_c25_t2.txt
Running 30s test @ http://localhost:8080/test/large.bin
  2 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.93ms    5.04ms  83.93ms   84.37%
    Req/Sec   795.03    128.99     1.30k    77.09%
  Latency Distribution
     50%   13.56ms
     75%   16.54ms
     90%   20.34ms
     99%   32.56ms
  47499 requests in 30.07s, 46.39GB read
Requests/sec:   1579.72
Transfer/sec:      1.54GB