benchmarks/raw/s3_baseline/large_c25_t4.txt
Running 30s test @ http://localhost:8080/test/large.bin
  2 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.28ms    3.11ms  41.62ms   82.61%
    Req/Sec   837.17     80.81     0.95k    84.50%
  Latency Distribution
     50%   13.26ms
     75%   15.18ms
     90%   18.39ms
     99%   26.16ms
  50024 requests in 30.03s, 48.86GB read
Requests/sec:   1665.87
Transfer/sec:      1.63GB