benchmarks/raw/s3_baseline/large_c50_t4.txt
Running 30s test @ http://localhost:8080/test/large.bin
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.50ms    4.94ms 136.97ms   90.31%
    Req/Sec     0.88k    86.04     1.07k    89.33%
  Latency Distribution
     50%   27.34ms
     75%   29.23ms
     90%   32.78ms
     99%   50.04ms
  52526 requests in 30.04s, 51.30GB read
Requests/sec:   1748.36
Transfer/sec:      1.71GB