benchmarks/raw/s3_baseline/small_c25_t1.txt
Running 30s test @ http://localhost:8080/test/small.bin
  2 threads and 25 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.34ms    6.81ms 144.09ms   95.42%
    Req/Sec     8.36k     3.84k   14.38k    56.83%
  Latency Distribution
     50%    0.88ms
     75%    1.41ms
     90%    3.72ms
     99%   32.41ms
  495970 requests in 30.06s, 1.94GB read
Requests/sec:  16499.59
Transfer/sec:     66.03MB