benchmarks/raw/s3_baseline/small_c50_t3.txt
Running 30s test @ http://localhost:8080/test/small.bin
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms  536.02us  12.64ms   82.12%
    Req/Sec    13.37k     1.25k   20.20k    83.00%
  Latency Distribution
     50%    1.68ms
     75%    1.90ms
     90%    2.17ms
     99%    3.58ms
  798345 requests in 30.01s, 3.12GB read
Requests/sec:  26602.23
Transfer/sec:    106.45MB